In [9]:
import pandas as pd
import numpy as np

arr=np.array(range(0,10))
df=pd.DataFrame(arr ,columns=["A"])
print(df)

   A
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [13]:
arr=np.array([[1,2],[3,4]])
df=pd.DataFrame(arr ,columns=["A","B"])
print(df)

   A  B
0  1  2
1  3  4

In [15]:
# from python list

import pandas as pd
 
data = [
    ["Alice", 25],
    ["Bob", 30],
    ["Charlie", 35]
]
 
df = pd.DataFrame(data, columns=["Name", "Age"])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [24]:
df=pd.read_excel("data.xlsx")
print(df)

   first  second   thied
0      0        0      0
1     10       10     10
2     10       10     10
3     20       14      0
4     25       25     25
5      5        5      5
6     55       55     55
7     89        8     89
8    214      127    194

In [70]:
df = pd.read_json("newdata.json")
print(df)

    name  age              email  isStudent               skills
0  Alice   25  alice@example.com      False  [Python, HTML, CSS]

In [76]:
# Read csv files from the url
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")
print(df)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
# Eda 
Exploratory Data Analysis (EDA) is an essential first step in any data science project.

# It involves taking a deep look at the dataset to understand its structure, spot patterns,
# identify anomalies, and uncover relationships between variables. This process includes 
# generating summary statistics, checking for missing or duplicate data, and creating 
# visualizations like histograms, box plots, and scatter plots. The goal of EDA is to get 
# a clear picture of what the data is telling you before applying any analysis or machine 
# learning models.

In [80]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [82]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [86]:
df.describe() # # Stats for numeric columns

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [94]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [96]:
df.shape

(244, 7)